<a href="https://colab.research.google.com/github/RAYANE8LOUNIS/Deliveroo/blob/main/Introduction_to_SQL_sub_queries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Introduction to SQL Sub-Queries

This notebook explore the basics of the use of sub-queries with SQL

In [3]:
import sqlite3

# Create a database in memory
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# Create Tables
cursor.execute("""
CREATE TABLE Client (
    ClientId TEXT PRIMARY KEY,
    Name TEXT,
    Address TEXT,
    DateOfBirth DATE
);
""")

cursor.execute("""
CREATE TABLE Equipment (
    EquipCode TEXT PRIMARY KEY,
    EquipDescription TEXT,
    Price REAL
);
""")

cursor.execute("""
CREATE TABLE Orders (
    OrderNo TEXT PRIMARY KEY,
    OrderDate DATE,
    ClientId TEXT,
    FOREIGN KEY (ClientId) REFERENCES Client(ClientId)
);
""")

cursor.execute("""
CREATE TABLE Equipment_Purchased (
    EquipCode TEXT,
    OrderNo TEXT,
    Quantity INTEGER,
    PRIMARY KEY (EquipCode, OrderNo),
    FOREIGN KEY (EquipCode) REFERENCES Equipment(EquipCode),
    FOREIGN KEY (OrderNo) REFERENCES Orders(OrderNo)
);
""")

conn.commit()
print("Tables created successfully!")

Tables created successfully!

In [4]:
# here is where to INSERTING VALUES

cursor.executemany("""
INSERT INTO Client (ClientId, Name, Address, DateOfBirth)
VALUES (?, ?, ?, ?);
""", [
    ('C022', 'James Murray', 'High St, Cambridge', '1998-08-12'),
    ('C012', 'Cornelius Garfield', 'Strand, Coventry', '1980-07-01'),
    ('C010', 'Mark Ekshaw', 'High Bank, Mansfield', '2002-01-18'),
    ('C001', 'James Worth', 'Old Road, Nottingham', '2005-05-20')
])

cursor.executemany("""
INSERT INTO Equipment (EquipCode, EquipDescription, Price)
VALUES (?, ?, ?);
""", [
    ('E001', 'Nao Robot', 4000),
    ('E006', 'PC', 300.00),
    ('E005', 'Pens', 1.50),
    ('E009', 'Baxter Robot', 53000.75)
])

cursor.executemany("""
INSERT INTO Orders (OrderNo, OrderDate, ClientId)
VALUES (?, ?, ?);
""", [
    ('O01', '2017-03-02', 'C022'),
    ('O02', '2017-03-10', 'C001')
])

cursor.executemany("""
INSERT INTO Equipment_Purchased (EquipCode, OrderNo, Quantity)
VALUES (?, ?, ?);
""", [
    ('E001', 'O01', 20),
    ('E006', 'O01', 10),
    ('E006', 'O02', 5),
    ('E009', 'O02', 5)
])

conn.commit()
print("Data inserted successfully!")

Data inserted successfully!

In [5]:
# here is a list clients who were 18 before Jan 1, 2017
cursor.execute("""
SELECT Name, Address, DateOfBirth
FROM Client
WHERE DateOfBirth <= date('2017-01-01', '-18 years');
""")

for row in cursor.fetchall():
    print(row)

('James Murray', 'High St, Cambridge', '1998-08-12')
('Cornelius Garfield', 'Strand, Coventry', '1980-07-01')

In [6]:
#Increase price of equipment E09 by 20%
cursor.execute("""
UPDATE Equipment
SET Price = Price * 1.2
WHERE EquipCode = 'E009';
""")
conn.commit()
print("Price updated successfully!")

Price updated successfully!

In [7]:
# here is the List of clients with orders, sorted by name and order date:
cursor.execute("""
SELECT c.Name AS 'Name of the Client',
       c.Address AS 'Address of the Client',
       c.DateOfBirth AS 'Date of Birth',
       o.OrderNo AS 'Order No',
       o.OrderDate AS 'Date Order Made'
FROM Client c
JOIN Orders o ON c.ClientId = o.ClientId
ORDER BY c.Name ASC, o.OrderDate ASC;
""")

for row in cursor.fetchall():
    print(row)

('James Murray', 'High St, Cambridge', '1998-08-12', 'O01', '2017-03-02')
('James Worth', 'Old Road, Nottingham', '2005-05-20', 'O02', '2017-03-10')

That's it, this code should be used as a complement to the article